# IFCExtrusionData Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData Constructor
IFCExtrusionData Class See Also
---
Constructs a new empty extrusion data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCExtrusionData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCExtrusionData()
```

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace